System Bootstrap, Version 12.1(3r)T2, RELEASE SOFTWARE (fc1)
Copyright (c) 2000 by cisco Systems, Inc.
PT 1001 (PTSC2005) processor (revision 0x200) with 60416K/5120K bytes of memory

Readonly ROMMON initialized

Self decompressing the image :
########################################################################## [OK]

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco Internetwork Operating System Software
IOS (tm) PT1000 Software (PT1000-I-M), Version 12.2(28), RELEASE SOFTWARE (fc5)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2005 by cisco Systems, Inc.
Compiled Wed 27-Apr-04 19:01 by miwang

PT 1001 (PTSC2005) processor (revision 0x200) with 60416K/5120K bytes of memory
.
Processor board ID PT0123 (0123)
PT2005 processor: part number 0, mask 01
Bridging software.
X.25 software, Version 3.0.0.
4 FastEthernet/IEEE 802.3 interface(s)
2 Low-speed serial(sync/async) network interface(s)
32K bytes of non-volatile configuration memory.
63488K bytes of ATA CompactFlash (Read/Write)


         --- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]: no


Press RETURN to get started!



Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname RTRRIP
RTRRIP(config)#








RTRRIP con0 is now available






Press RETURN to get started.













RTRRIP>enable
RTRRIP#conf
Configuring from terminal, memory, or network [terminal]? 
Enter configuration commands, one per line.  End with CNTL/Z.
RTRRIP(config)#int
RTRRIP(config)#interface lo
RTRRIP(config)#interface loopback 0

RTRRIP(config-if)#
%LINK-5-CHANGED: Interface Loopback0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up

RTRRIP(config-if)#ip a
RTRRIP(config-if)#ip add
RTRRIP(config-if)#ip address ?
  A.B.C.D  IP address
RTRRIP(config-if)#ip address 172.20.0.0 255.255.255.0
Bad mask /24 for address 172.20.0.0
RTRRIP(config-if)#ip address 172.20.0.1 255.255.255.0
RTRRIP(config-if)#exit
RTRRIP(config)#interface loopback 1

RTRRIP(config-if)#
%LINK-5-CHANGED: Interface Loopback1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback1, changed state to up

RTRRIP(config-if)#ip address 172.20.1.1 255.255.255.0
RTRRIP(config-if)#exit
RTRRIP(config)#interface loopback 2

RTRRIP(config-if)#
%LINK-5-CHANGED: Interface Loopback2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback2, changed state to up
ip address 172.20.2.1 255.255.255.0
RTRRIP(config-if)#exit
RTRRIP(config)#int
RTRRIP(config)#interface ser
RTRRIP(config)#interface serial 2/0
RTRRIP(config-if)#no sh
RTRRIP(config-if)#no shutdown 

RTRRIP(config-if)#
%LINK-5-CHANGED: Interface Serial2/0, changed state to up

RTRRIP(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial2/0, changed state to up

RTRRIP(config-if)#ip address 10.3.3.2 255.255.255.0
RTRRIP(config-if)#exit
RTRRIP(config)#router rip
RTRRIP(config-router)#network 10.3.3.0
RTRRIP(config-router)#network 172.20.0.0
RTRRIP(config-router)#no network 10.3.3.0
RTRRIP(config-router)#exit
RTRRIP(config)#router os
RTRRIP(config)#router ospf 1
RTRRIP(config-router)#router-id 1.1.3.3
RTRRIP(config-router)#network 10.3.3.0 0.0.0.255 area 0
RTRRIP(config-router)#red
RTRRIP(config-router)#redistribute rip s
RTRRIP(config-router)#redistribute rip subnets 
RTRRIP(config-router)#
00:53:39: %OSPF-5-ADJCHG: Process 1, Nbr 2.2.2.2 on Serial2/0 from LOADING to FULL, Loading Done

RTRRIP(config-router)#exit
RTRRIP(config)#no router rip
RTRRIP(config)#router rip
RTRRIP(config-router)#version 2
RTRRIP(config-router)#
RTRRIP#conf
Configuring from terminal, memory, or network [terminal]? 
Enter configuration commands, one per line.  End with CNTL/Z.
RTRRIP(config)#router rip
RTRRIP(config-router)#network 172.20.0.0
RTRRIP(config-router)#exit
RTRRIP(config)#
%SYS-5-CONFIG_I: Configured from console by console

RTRRIP(config)#no router ospf 1
RTRRIP(config)#